import Mock from 'mockjs'
import result from './mock.json'
Mock.mock(RegExp('/user/userInfo' + '.*'), 'get', options => {
  return result
})

Mock.mock(RegExp('/roulList' + '.*'), 'get', options => {
  return {
    'code': 200,
    'data': {
      'content': [{
        'id': '2131231231231231231',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'name': 'T0101审核逮捕案件信息卡'
      }]
    }
  }
})

Mock.mock(RegExp('/roulList2' + '.*'), 'get', options => {
  return {
    'code': 200,
    'data': {
      'content': [{
        'id': '2131231231231231231',
        'type': '1',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'type': '1',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'type': '1',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'type': '1',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'type': '1',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'type': '1',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'type': '1',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'type': '1',
        'name': 'T0101审核逮捕案件信息卡'
      }, {
        'id': '2131231231231231231',
        'type': '1',
        'name': 'T0101审核逮捕案件信息卡'
      }]
    }
  }
})
